In [1]:
import numpy as np
import pandas as pd

In [2]:
datam = [1,4,14,51,43]

In [3]:
datam

[1, 4, 14, 51, 43]

In [5]:
pd.DataFrame(datam, columns = ["columns name"])

   columns name
0             1
1             4
2            14
3            51
4            43

In [9]:
m = np.arange(1,10).reshape((3,3))

In [10]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [11]:
pd.DataFrame(m, columns= ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
pd.DataFrame( data = m, columns= ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [13]:
df = pd.DataFrame( data = m, columns= ["var1", "var2", "var3"])

In [15]:
df.head(1)

   var1  var2  var3
0     1     2     3

In [16]:
df.tail(2)

   var1  var2  var3
1     4     5     6
2     7     8     9

In [17]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [18]:
for i in df.columns:
    print(i)

var1
var2
var3

In [20]:
df.columns = ["var1","var2","var3"]

In [21]:
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [22]:
df.shape

(3, 3)

In [23]:
df.ndim

2

In [24]:
df.size

9

In [25]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [28]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [29]:
mydict = {"var1" : s1,"var2" : s2, "var3" : s3 }

In [30]:
df1 = pd.DataFrame(mydict)

In [31]:
df1

   var1  var2  var3
0     0     8     3
1     0     1     7
2     0     6     5
3     4     2     4
4     6     6     3

In [33]:
pd.read_csv("ornekcsv.csv", delimiter = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [35]:
df3 = pd.read_csv("ornekcsv.csv", delimiter = ";")

In [37]:
df3.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [38]:
df1

   var1  var2  var3
0     0     8     3
1     0     1     7
2     0     6     5
3     4     2     4
4     6     6     3

In [39]:
df1[1:3]

   var1  var2  var3
1     0     1     7
2     0     6     5

In [40]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [41]:
[i for i in df1.index]

[0, 1, 2, 3, 4]

In [42]:
df1.index = ["a","b","c","d","e"]

In [43]:
df1

   var1  var2  var3
a     0     8     3
b     0     1     7
c     0     6     5
d     4     2     4
e     6     6     3

In [45]:
df1["b":"d"]

   var1  var2  var3
b     0     1     7
c     0     6     5
d     4     2     4

In [46]:
"var2" in df1

True

In [47]:
"ali" in df1

False

In [48]:
from numpy.random import randn
np.random.seed(101)

In [49]:
df3 = pd.DataFrame(randn(5,4), index = "A B C D E".split(), columns = "W X Y Z".split())

In [50]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
pd.DataFrame(randn(5,4), "A B C D E".split(), "W X Y Z".split())

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [52]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [53]:
df3[["W"]]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [55]:
a = ["W", "X"]
df3[a]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [56]:
df3 [["W","X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [59]:
df3.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [61]:
df3["A":"C"]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [62]:
df3["C":"C"]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001